import { extend } from 'koot';

import Page from '../';

// ============================================================================

const procedures = [
    {
        title: '启动发动机前',
        steps: [
            ['前序检查', '完成'],
            [2, '发动机罩', '卸下'],
            [2, '空速管罩', '卸下'],
            [2, '轮挡', '撤除'],
            '',
            ['舱门', '关闭'],
            ['驻机刹车', '按需'],
            ['BAT', '电瓶 1 & 2', 'ON'],
            ['GEN', '发电机 1 & 2', 'ON'],
            ['GPU', '外部电源', '按需'],
            ['FADEC', '验证'],
            [
                2,
                <>
                    ・MFD 左上【 % Thrust 】下方
                    <br />
                    　出现【 FADEC CH * 】
                </>,
            ],
        ],
    },
    {
        title: '启动发动机 1/2',
        steps: [
            '收到 ATC 发车许可',
            '',
            ['Strobe', '频闪灯', 'ON'],
            ['CAS', '警告信息', '检查'],
            ['油门杆', '慢车'],
            ['刹车', '踩住'],
            ['Engine Knob', '引擎旋钮', 'RUN'],
            ['Fule Pump', '油泵', '检查'],
            [
                2,
                <>
                    a. 验证 CAS 警告信息存在
                    <br />
                    　【 FUEL PUMP ON 】
                    <br />
                    b. 确认听到油泵工作的声音
                </>,
            ],
            '',
            ['CAS', '警告信息', '验证不存在'],
            [undefined, <>ENGINE START BAT TEMP</>],
            [undefined, <>ENGINE START VOLTS</>],
            '',
            ['引擎按钮', '按下'],
            ['引擎参数', '监视'],
            [
                2,
                <>
                    N2 达 25% 时，确保 N1 正增长
                    <br />
                    当以下任意情况发生时，终止：
                    <br />
                    ・ITT 超限（红线）
                    <br />
                    ・N2 达 25% 时没有 N1 读数
                    <br />
                    ・8 秒内无熄灯迹象
                    <br />
                    ・启动后滑油压力低
                    <br />
                    　（Oil Pressure）
                </>,
            ],
        ],
    },
    {
        title: '启动发动机 2/2',
        steps: [
            ['EIS', '引擎信息', '检查参数正常'],
            ['IPS', '引擎防冰', '按需'],
            ['ECS', '舱内环境控制（空调）', '设定'],
            ['GPU', '外部电源', '断开'],
            ['Oxygen Master', '供氧总开关', 'ON'],
            ['航电初始化流程', '完成'],
            ['CAPS', '安全降落伞插销', '拔出'],
            ['乘客', '通知'],
            ['安全带（游戏版本没有）', '系好'],
            '',
            '电瓶 1 & 2 至少运行 2 分钟后',
            '',
            ['BLEED', '引气开关', 'BLEED'],
        ],
    },
    {
        title: '滑行前',
        steps: [
            '收到 ATC 滑行许可',
            '',
            ['通讯与导航', '设置'],
            ['ATIS（机场通波）/ 许可', '获取'],
            ['高度表', '调定 / 检查'],
            ['应答机', '调定'],
            ['航向 / 初始高度', '调定'],
            ['飞行控制', '检查'],
            '',
            [
                2,
                <>
                    ・若引擎防冰开启时，
                    <br />
                    　出现【 TT2 HEAT FAIL 】警告，
                    <br />
                    　不允许离港。
                </>,
            ],
            [
                2,
                <>
                    ・若外温（OAT）低于 5℃，
                    <br />
                    　同时有明显水气，
                    <br />
                    　或能见度不足 1.6km，
                    <br />
                    　需开启引擎防冰。
                </>,
            ],
            '',
            ['Trim', '配平', '调定'],
            ['Flaps', '襟翼', '50%'],
            ['Elec. Roll Trim', '电动横滚配平', '调定'],
            ['TO/GA 按钮', '按下'],
            ['Pitch', '俯仰（PFD 上的指引）', '10°'],
            ['CAS', '警告信息', '检查'],
            ['座椅', '正常位置'],
            ['刹车', '检查'],
        ],
    },
    {
        title: '起飞前',
        steps: [
            ['离场简令', '完成'],
            ['Landing', '着陆灯', '按需'],
            '',
            [
                2,
                <>
                    ・若外温（OAT）高于 5℃，
                    <br />
                    　在地面时，空速管加热
                    <br />
                    　只能最多连续开启 5 分钟。
                    <br />
                    　温暖环境长时间使用，会损坏
                    <br />
                    　空速管探针的复合材料结构。
                </>,
            ],
            '',
            ['PROBE HEAT', '空速管加热', 'ON'],
            ['IPS', '引擎防冰', '按需'],
            ['IPS', '机翼/安定面防冰', 'OFF'],
            ['CAS', '警告信息', '检查'],
            ['Trim', '配平', '调定'],
            ['Flaps', '襟翼', '50%'],
            ['CAS', '警告信息', '验证不存在'],
            [undefined, <>TAKEOFF EMER BAT</>],
            '',
            ['MFD', '航电多功能屏幕', '配置'],
        ],
    },
    {
        title: '正常起飞',
        steps: [
            '收到 ATC 起飞许可',
            '',
            ['刹车', '踩住'],
            ['油门杆', 'T/O'],
            ['推力设定（N1%）', '对齐游标'],
            ['引擎参数', '检查正常'],
            ['刹车', '松开'],
            ['VR', '抬轮速度', '85 KIAS (指示空速)'],
            ['Pitch', '俯仰', '10°'],
            ['Gear', '起落架', '正爬升率后收起'],
            ['Flaps', '襟翼', '最大 115 KIAS 回收'],
            ['空速', '按爬升参数'],
        ],
    },
    {
        title: '爬升',
        steps: [
            ['油门杆', 'MCT'],
            ['引擎参数', '监视'],
            ['客舱压力', '监视'],
            [undefined, <>MFD 多功能显示器</>],
            [undefined, '左下角 Cabin Press'],
            '',
            ['防冰', '按需'],
            ['高度表', '过渡高度后 29.92 / 1013'],
        ],
    },
    {
        title: '巡航',
        steps: [
            ['油门杆', 'MCT'],
            ['防冰', '按需'],
            '',
            'RVSM 空域，机翼防冰开启时',
            [undefined, '通知管制无法满足 RVSM 要求'],
            '',
            ['EIS', '引擎信息', '监视'],
        ],
    },
    {
        title: '下降',
        steps: [
            ['油门杆', '按需'],
            ['着陆机场标高', '检查'],
            [undefined, <>触控屏 - MFD</>],
            [undefined, 'Aircraft Systems'],
            [undefined, 'Landing Field Elev'],
            '',
            ['防冰', '按需'],
            ['高度表', '过渡高度层后当地修压'],
            ['座椅与安全带', '系好'],
            ['刹车压力', '检查'],
        ],
    },
    {
        title: '进近',
        steps: [
            ['进近简令', '完成'],
            ['座椅', '正常位置'],
            ['防冰', '按需'],
            ['灯光', '按需'],
            ['Flaps', '襟翼', '50%'],
            ['空速', '140 KIAS (指示空速)'],
        ],
    },
    {
        title: '着陆前',
        steps: [
            ['Gear', '起落架', '放下 & 锁定'],
            ['Flaps', '襟翼', '按需'],
            ['Diff PSI', '客舱压力区别', '~0 PSI'],
            ['IPS', '风挡防冰', 'OFF'],
            [2, <>・防冰液会降低能见度</>],
            '',
            ['自动驾驶', 'OFF'],
            ['空速', 'VREF 至 VREF + 10'],
            ['刹车压力', '检查'],
        ],
    },
    {
        title: '着陆',
        steps: [
            '收到 ATC 着陆许可',
            '',
            ['Flaps', '襟翼', '100%'],
            [undefined, '若机体结冰：50%'],
            '',
            [
                2,
                <>
                    ・若机体未结冰，
                    <br />
                    　展开 100% 襟翼时有警告：
                    <br />
                    　触控屏 - MFD
                    <br />
                    　　＞ Aircraft Systems
                    <br />
                    　　　＞ IPS Stall Offset Rest
                    <br />
                    　可重置这一警告。
                </>,
            ],
            '',
            ['空速', 'VREF'],
            [undefined, '按着陆性能'],
        ],
    },
    {
        title: '着陆后',
        steps: [
            ['刹车', '按需'],
            ['Flaps', '襟翼', '回收'],
            ['IPS', '机翼/安定面防冰', 'OFF'],
            ['IPS', '引擎防冰', 'OFF'],
            '',
            [
                2,
                <>
                    ・若外温（OAT）高于 5℃，
                    <br />
                    　在地面时，空速管加热
                    <br />
                    　只能最多连续开启 5 分钟。
                    <br />
                    　温暖环境长时间使用，会损坏
                    <br />
                    　空速管探针的复合材料结构。
                </>,
            ],
            '',
            ['PROBE HEAT', '空速管加热', 'OFF'],
            ['外部灯光', '按需'],
            ['刹车', '检查'],
        ],
    },
    {
        title: '关车',
        steps: [
            ['油门杆', '慢车'],
            ['IPS', '引擎防冰', 'OFF'],
            ['BLEED', '引气开关', 'FRESH'],
            ['Oxygen Master', '供氧总开关', 'OFF'],
            ['灯光', 'OFF'],
            '',
            [
                2,
                <>
                    ・为避免 FADEC 系统失效，
                    <br />
                    　在 N2 低于 24% 之前，
                    <br />
                    　不要关闭飞机电源。
                </>,
            ],
            '',
            ['GEN', '发电机 1 & 2', 'OFF'],
            ['Engine Knob', '引擎旋钮', 'OFF'],
            ['引擎按钮', '按下'],
            ['N2', '低于 24%'],
            ['CAPS', '安全降落伞插销', '复位'],
            ['BAT', '电瓶 1 & 2', 'OFF'],
            ['驻机刹车', '按需'],
        ],
    },
];

// const uppers = changes.slice(0, 2);
// const lowers = changes.slice(2);

// Functional Component =======================================================

const ThisPage = extend({})(() => {
    return <Page procedures={procedures} />;
});

export default ThisPage;
